#ifndef _AppDelegate_H_
#define _AppDelegate_H_

#include<LagHead.h>
namespace Lag {
	class AppDelegate {
	public:

		///-------------------------------------------------------------------------------------------------
		/// @fn	AppDelegate::AppDelegate();
		///
		/// @brief	Default constructor
		///
		/// @author	Lag
		///-------------------------------------------------------------------------------------------------

		AppDelegate();

		///-------------------------------------------------------------------------------------------------
		/// @fn	AppDelegate::~AppDelegate();
		///
		/// @brief	Destructor
		///
		/// @author	Lag
		///-------------------------------------------------------------------------------------------------

		~AppDelegate();

		///-------------------------------------------------------------------------------------------------
		/// @fn	void AppDelegate::run();
		///
		/// @brief	程序的主循环
		///
		/// @author	Lag
		///-------------------------------------------------------------------------------------------------

		void run();

		void Init();

		void Release();
	private:
		/// @brief	GL主窗口
		GLFWwindow* m_pHandle;
	};
}
#endif